package Ayan;
import java.util.Arrays;
import java.util.Locale;
import java.util.Scanner;
public class Строки {
    public static void main(String[] args) {
        Scanner x = new Scanner(System.in);
        char a [] = {'a', 'y', 'a', 'n'};
        String b = new String(a);
        String e = "     Ayan Be1t     ";
        System.out.println(Character.isDigit(e.trim().charAt(7)));
        System.out.println(Character.isAlphabetic(b.charAt(0)));
        String f = String.valueOf(10); // f is string. Превращает любой тип данных в String
        int g = Integer.parseInt(f); // g is integer

        // Метод equals() мы используем, чтобы сравнивать какую-ту строку с другой переменной. Мы не можем это сделать используя "=="
        // Метод contains() мы используем, чтобы проверить содержит ли строка введённый в метод элемент или предложение
        // Метод trim() мы используем, чтобы убрать лишние пробелы, которые находятся вне строки
        // Метод getBytes() мы используем, чтобы превратить строку в массив из байтов (ASCII). Example: "Hello" ---> [72, 101, 108, 108, 111]. Но этот массив нужно обязательно где-то хранить
        // Метод toLowerCase() мы используем, чтобы все буквы в строке превратились в маленькие
        // Метод toUpperCase() мы используем, чтобы все буквы в строке превратились в заглавные
        // Метод equalsIgnoreCase() мы используем, чтобы сравнивать какую-ту строку с другой переменной, не обращая внимания буква маленькая или заглавная
        // Метод replace() мы используем, чтобы заменить старый элемент в строке на новый. В аргументы может принимать строки
        // Метод indexOf() мы используем, чтобы найти индекс элемента в строке. Можно ещё указать с какого до какого индекса он будет искать элемент
        // Метод codePointAt() мы используем, чтобы узнать ASCII число у элемента в заданном индексе
        // Метод codePointBefore() делает тоже самое, что и codePointAt(), но он узнаёт ASCII число у элемента который находится на индекс меньше выбранного
        //
    }
}
